const Coding_Training = {
    title: '编程练习',
    children: [
        '面试相关/编程练习/用递归算法实现，数组长度为5且元素的随机数在2-32间不重复的值',
        '面试相关/编程练习/写一个方法去掉字符串中的空格，要求传入不同的类型分别能去掉前、后、前后、中间的空格',
        '面试相关/编程练习/去除字符串中最后一个指定的字符',
        '面试相关/编程练习/写一个方法把下划线命名转成大驼峰命名',
        '面试相关/编程练习/写一个把字符串大小写切换的方法',
        '面试相关/编程练习/写一个去除制表符和换行符的方法',
        '面试相关/编程练习/统计某一字符或字符串在另一个字符串中出现的次数',
        '面试相关/编程练习/写一个判断数据类型的方法',
        '面试相关/编程练习/两数之和',
        '面试相关/编程练习/将数组扁平化并去除其中重复数据，最终得到一个升序且不重复的数组',
        '面试相关/编程练习/实现一个简易的红绿灯程序',
        '面试相关/编程练习/实现一个解析url的方法',
        '面试相关/编程练习/实现一个模板解析函数',
        '面试相关/编程练习/将-连接符的字符串转化为小驼峰命名',
        '面试相关/编程练习/查找字符串中出现最多的字符和个数',
        '面试相关/编程练习/实现千位分割符'
    ]
}

module.exports = Coding_Training