const Explain_Network = {
    title: '解释问题-网络篇',
    children: [
        '面试相关/解释问题/网络面试题/HTTP中常用的请求方法有哪些？哪些请求方法是安全的？为什么？',
        '面试相关/解释问题/网络面试题/HTTP中POST和GET方法有什么区别？',
        '面试相关/解释问题/网络面试题/在浏览器中输入URL到页面进行渲染的过程中发生了什么？',
        '面试相关/解释问题/网络面试题/HTTP中常见的状态码有哪些？分别表示什么意思？',
        '面试相关/解释问题/网络面试题/常见的浏览器内核有哪些？',
        '面试相关/解释问题/网络面试题/浏览器的主要组成部分',
        '面试相关/解释问题/网络面试题/浏览器如何解析CSS选择器？',
        '面试相关/解释问题/网络面试题/前端如何实现即时通讯？',
        '面试相关/解释问题/网络面试题/重排与重绘',
        '面试相关/解释问题/网络面试题/DOM-Tree是如何构建的？'
    ]
}

module.exports = Explain_Network